[v10.4]
1=最適化された残存データスキャンアルゴリズムにより、より多くの残存データをスキャン＆削除できます
2=拡張されたデータベースにより、350以上の頑固なプログラムを削除できます
3=頑固なプログラムリムーバーが強化され、アンインストールの問題があるプログラムをより正確に検出できるようになります
4=UIを改善しました
5=既知のバグを修正しました

[v10.3]
1=残存データスキャン機能が強化され、より多くのファイルとレジストリエントリをクリーンアップできます
2=アンインストールエンジンが強化され、より簡単に大きなプログラムを削除できます
3=データベースの拡大により、さらに210+の頑固なプログラムを削除できます
4=アンインストール歴史とインストールログの詳細ウィンドウを最大化することをサポートします
5=Windows10でのアプリの再構成問題を修復しました
6=既知のバグを修正しました

[v10.2]
1=頑固プログラムクリーナー機能が強化されたことにより、Microsoftインストーラープログラムに起こったアンインストール問題をより多く検出できます
2=データベースの拡大により、さらに240+の頑固プログラムを削除します
3=アンインストールの残り物検出アルゴリズムを最適化して、ソフトアンインストールした後の残り物をより多くスキャンできます
4=インストールモニターを最適化して、ソフトウェアアップデートを監視する時に、より完全なインストールログをもらいます
5=より良いUIで、よりよいユーザー体験が得られます
6=既知のバグを修正しました

[v10.1]
1=新しい頑固なプログラム削除機能により、通常で削除できないプログラムをより簡単に削除できます
2=データベースの拡大により、200以上の頑固なプログラムを削除できます
3=Windowsコンテキストメニューに強力なアンインストールオプションが表示されるかをカスタマイズできます
4=プログラムリストにランタイムコンポーネントが表示されるかをカスタマイズできます
5=不正確なプログラムサイズの検出、大きいサイズプログラムの不安定インストールモニタ問題を修正しました
6=既知のバグを修正しました

[v10.0]
1=アンインストール速度を50%向上しました
2=スキャンアルゴリズムの改善により、30%以上の残される残存データをスキャンできます
3=ソフトウェアのヘルスを強化し、サイトの通知のブロックを新たにサポートします
4=強化されたインストールモニターはより多くのプログラムのインストールを監視し、モニタリングシステムサービス、タスクスケジューラ、およびDLL登録も新たにサポートします
5=プログラム検出アルゴリズムを最適化して、使用頻度の低いプログラムとバンドルウェアをより正確に検出できます
6=一部のプログラムを更新した後、時折誤った残りのプロンプトが修正されました
7=MPC-HC、SpyHunter5、Avast Antivirus、Rockstar Games、IntelliJ IDEAなど40以上の頑固なプログラムのアンインストールを新しいサポートします
8=Firefox、WinRAR、Mozilla Thunderbirdなどの人気のあるプログラムの多言語バージョンの更新を新たにサポートしました
9=Chromium版の「Microsoft Edge」上のプラグインの削除をサポートします
10=よりよいUI、よりユーザーフレンドリーな体験を
11=2つのテーマ：ダーク＆ライト
12=ローカリゼーション：38か言語対応